---
kind: method
id: M:Autodesk.Revit.DB.ShapeImporter.Dispose
source: html/710c3d7a-957f-dbc0-50c0-39cc83bbf92c.htm
---
# Autodesk.Revit.DB.ShapeImporter.Dispose Method

Releases all resources used by the ShapeImporter

## Syntax (C#)
```csharp
public void Dispose()
```